* [pd.concat()](#concat)

___

https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

___

You can perform concatenation both on columns and on rows.

In [2]:
import numpy as np
import pandas as pd

In [3]:
data_one = {
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']
}

In [4]:
data_two = {
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
}

In [5]:
one = pd.DataFrame(data_one)
two = pd.DataFrame(data_two)

In [6]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [7]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

___

<a id='concat'></a>

__`pd.concat()`__

Pass in as a list the dataframe objects.

In [9]:
pd.concat([one, two], axis=1) # we've joined them along the columns

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [10]:
pd.concat([two, one], axis=1)

    C   D   A   B
0  C0  D0  A0  B0
1  C1  D1  A1  B1
2  C2  D2  A2  B2
3  C3  D3  A3  B3

In [11]:
pd.concat([one, two], axis=0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

___

But let's imagine the situation where you actually do want to join them by rows, but you want to just have C and D relabelled A and B, because maybe in a different data set they had different column names.

So how do we do that?
<br>Well, the easiest way to do this is to simply rename the columns of two.

In [12]:
two.columns = one.columns

In [13]:
two

    A   B
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [16]:
pd.concat([one, two], axis=0) # keep in mind it's still keeping this duplicated index

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [17]:
mydf = pd.concat([one, two], axis=0)
mydf

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [18]:
mydf.index = range(len(mydf))

In [19]:
mydf

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3